/*
    Создайте цикл, выводящий на экран чётные цифры из диапазона от 2 до 10 включительно.

 */


public class Task2_8_1 {
    public static void main(String[] args) {
        for(int i = 2; i<10; i = i + 2 ){
            System.out.println(i);
        }
    }

}
