/*
Напишите код, который позволяет из строки, содержащей значение "Sometimes", напечатать третий символ этого слова.
 */

public class Exemple3_2_1 {
    public static void main(String[] args) {
        System.out.println("Sometimes".charAt(2));
        /*
        //Или такой вариант:
        String sometime = "Sometime";
        System.out.println(sometime.charAt(2));
         */
    }
}
